# SetPartCustomDataInteger Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..SetPartCustomDataInteger Method
FabricationPart Class See Also
---
Set the custom data integer value for the specified custom data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetPartCustomDataInteger(
	int customId,
	int value
)
```

Visual Basic
---
```text
Public Sub SetPartCustomDataInteger ( _
	customId As Integer, _
	value As Integer _
)
```

Visual C++
---
```text
public:
void SetPartCustomDataInteger(
	int customId,
	int value
)
```

# ### Parameters
customId
    Type: System..::..Int32 The identifier of the custom data field to set.
value
    Type: System..::..Int32 The integer value of the custom data. If the data is not an integer type the value will be parsed according to the fabrication confifuration rules.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The custom data does not exist on the part. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace